app/Http/Controllers/user/AccountController.php

    public function profile() {

        $id = Auth::user()->id;

        $user = User::where('id', $id)->first();
---
select * from `users` where `id` = 1 limit 1