app/Http/Controllers/user/GoogleAuthController.php

    public function callbackGoogle()
    {
        try {
            $google_user = Socialite::driver('google')->user();

            $user = User::where('email', $google_user->getEmail())->first();
---
select * from `users` where `email` = 'duongkhang6401@gmail.com' limit 1