app/Http/Controllers/user/HomeController.php

select * from `careers` where `status` = 1 order by `name` asc
select * from `job_types` where `job_types`.`id` in (1, 2)
select * from `users` where `users`.`id` in (21, 22, 24, 26, 27, 28)
select exists(select * from `saved_jobs` where (`user_id` = 3 and `job_id` = 168)) as `exists`
select * from `job_types` where `job_types`.`id` in (1, 5)
select * from `users` where `users`.`id` in (23, 24, 26, 27, 28)
select exists(select * from `saved_jobs` where (`user_id` = 3 and `job_id` = 177)) as `exists`
---
    public function index() {

        $careers = Careers::where('status', 1)
                  ->where('isPopular', 1)
                  ->orderBy('name', 'ASC')
                  ->withCount('jobs')
                  ->get()
                  ->chunk(4);

        $newCareers = Careers::where('status', 1)
                    ->orderBy('name','ASC')
                    ->get();

        $featureJobs = Job::where('status', 1)
            ->where('isFeatured', 1)
            ->with('jobType', 'user')
            ->orderBy('created_at', 'DESC')
            ->take(6)
            ->get()
            ->map(function ($job) {
                $job->is_saved = Auth::check() && SavedJob::where([
                    'user_id' => Auth::id(),
                    'job_id' => $job->id
                ])->exists();
                return $job;
        });


        $latesJobs = Job::where('status', 1)
            ->with('jobType', 'user')
            ->orderBy('created_at', 'DESC')
            ->take(6)
            ->get()
            ->map(function ($job) {
                $job->is_saved = Auth::check() && SavedJob::where([
                    'user_id' => Auth::id(),
                    'job_id' => $job->id
                ])->exists();
                return $job;
        });