app/Http/Controllers/user/JobsController.php

    public function index(Request $request) {

        $careers = Careers::where('status', 1)->get();
        $jobTypes = JobType::where('status', 1)->get();
---
select * from `careers` where `status` = 1
select * from `job_types` where `status` = 1

    public function detail($id) {


        $job = Job::where([
            'id' => $id,
            'status' => 1,
        ])->with(['jobType','career','user'])->first();

        if ($job == null) {
            abort(404);
        }

        $count = 0;
        if (Auth::check()) {
            $count = SavedJob::where([
                'user_id' => Auth::user()->id,
                'job_id' => $id,
            ])->count();
        }

        $userHasApplied = false;
        if (Auth::check()) {
            $userHasApplied = JobApplication::where([
                'user_id' => Auth::user()->id,
                'job_id' => $id
            ])->count();
        }

        $applications = JobApplication::where('job_id',$id)->with('user')->get();
---
select * from `careers` where `careers`.`id` in (31)
select * from `job_types` where `job_types`.`id` in (5)
select * from `users` where `users`.`id` in (23)
select count(*) as aggregate from `saved_jobs` where (`user_id` = 3 and `job_id` = '176')
select count(*) as aggregate from `job_applications` where (`user_id` = 3 and `job_id` = '176')
select * from `job_applications` where `job_id` = '176'