app/Http/Controllers/admin/AccountController.php

  public function profile()
  {
    $id = Auth::user()->id;
    $user = User::find($id);
---
select * from `users` where `users`.`id` = 1 limit 1