app/Http/Controllers/admin/AdminController.php

select count(*) as aggregate from `users` where `role` = 'user'
select count(*) as aggregate from `users` where `role` = 'employer'
select count(*) as aggregate from `job_applications`
select count(*) as aggregate from `saved_jobs`
select * from `careers` where `isPopular` = '1' limit 5 offset 0
select count(*) as aggregate from `careers` where `isPopular` = '1'
select * from `careers` where `careers`.`id` in (13, 16, 28)
---
  public function index()
  {
    $totalJobs = Job::count();
    $totalUsers = User::where('role', 'user')->count();
    $totalEmployers = User::where('role', 'employer')->count();
    $totalApplications = JobApplication::count();
    $totalSavedJobs = SavedJob::count();
    $isPopularCareers = Career::where('isPopular', env('POPULAR'))->paginate(5, ['*'], 'popular_career');
    $featuredJobs = Job::where('isFeatured', 1)->with('career')->paginate(5, ['*'], 'featured_jobs');