app/Http/Controllers/admin/CareerController.php

select * from `careers` order by `created_at` desc limit 5 offset 10
select count(*) as aggregate from `careers`
---
  public function index()
  {
    $careers = Career::orderBy('created_at', 'DESC')->paginate(5);