app/Http/Controllers/admin/JobController.php

select * from `careers` where `careers`.`id` in (11, 13, 16, 28)
---
  public function index(Request $request)
  {
    $jobs = Job::orderBy('created_at', 'DESC');
    if (!empty($request->keyword)) {
      $jobs = $jobs->where('title', 'like', '%' . $request->keyword . '%');
    }
    if (!empty($request->date)) {
      $jobs = $jobs->whereDate('created_at', $request->date);
    }
    $jobs = $jobs->with('career')->paginate(7);