app/Http/Controllers/admin/UserController.php

select * from `users` where `role` = 'user' order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `users` where `role` = 'user'
---
  public function getUser(Request $request)
  {
    $users = User::where('role', 'user');
    if (!empty($request->keyword)) {
      $users = $users->where('fullname', 'like', '%' . $request->keyword . '%');
    }
    if (!empty($request->date)) {
      $users = $users->whereDate('created_at', $request->date);
    }
    $users = $users->latest()->paginate(5);